#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary><strong>Validation Output</strong></summary>

```<br />
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`
<details><summary><strong>Show Plan</strong></summary>

``` <br />
terraform
data.azurerm_client_config.current: Reading...
module.pubip.azurerm_public_ip.pubip: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/publicIPAddresses/pubip-twitter-auto]
module.cr.azurerm_container_registry.cr: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerRegistry/registries/crTwitterAuto]
module.rg.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kMTliMmQzMi02ZmFjLTQxODUtYTY4Mi1jY2YyNjYxNWQ4Yzg7b2JqZWN0SWQ9YzdmOTkwMWItMzBiMC00MjljLTk0ZTktMzQxOTEwMTVjN2RiO3N1YnNjcmlwdGlvbklkPTViMTg1ZjM0LTc1ZWItNDI0NS04NjZiLWRhNmU2OTQwNDAyMTt0ZW5hbnRJZD1lOTk0MDcyYi01MjNlLTRiZmUtODZlMi00NDJjNWUxMGIyNDQ=]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto]
module.nsg.azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto]
module.sa.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Storage/storageAccounts/mysonarqubestorage]
module.aks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerService/managedClusters/aks-twitter-auto]
module.snet.azurerm_subnet.snet: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto/subnets/snet-twitter-auto]
module.ss.azurerm_storage_share.ss: Refreshing state... [id=https://mysonarqubestorage.file.core.windows.net/mysonarqubedata]
module.ni.azurerm_network_interface.ni: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto]
module.helm.helm_release.kube-prometheus: Refreshing state... [id=kube-prometheus-stackr]
module.nisga.azurerm_network_interface_security_group_association.nisga: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto|/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto]
module.cg.azurerm_container_group.cg: Refreshing state... [id=/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerInstance/containerGroups/mysonarcube]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.aks.azurerm_kubernetes_cluster.aks has been deleted
  - resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerService/managedClusters/aks-twitter-auto"
      - kube_config                         = (sensitive value) -> null
      - kube_config_raw                     = (sensitive value) -> null
      - name                                = "aks-twitter-auto" -> null
        tags                                = {
            "Environment" = "Development"
        }
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cg.azurerm_container_group.cg has been deleted
  - resource "azurerm_container_group" "cg" {
      - fqdn                        = "my-sonarqube.eastus.azurecontainer.io" -> null
      - id                          = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerInstance/containerGroups/mysonarcube" -> null
      - ip_address                  = "52.152.192.31" -> null
        name                        = "mysonarcube"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ni.azurerm_network_interface.ni has been deleted
  - resource "azurerm_network_interface" "ni" {
      - id                            = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto" -> null
        name                          = "ni-twitter-auto"
      - private_ip_address            = "10.0.1.4" -> null
        tags                          = {
            "Environment" = "Development"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.nisga.azurerm_network_interface_security_group_association.nisga has been deleted
  - resource "azurerm_network_interface_security_group_association" "nisga" {
      - id                        = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto|/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto" -> null
        # (2 unchanged attributes hidden)
    }

  # module.nsg.azurerm_network_security_group.nsg has been deleted
  - resource "azurerm_network_security_group" "nsg" {
      - id                  = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto" -> null
        name                = "nsg-twitter-auto"
        tags                = {
            "Environment" = "Development"
        }
        # (3 unchanged attributes hidden)
    }

  # module.rg.azurerm_resource_group.rg has been deleted
  - resource "azurerm_resource_group" "rg" {
      - id       = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto" -> null
      - location = "eastus" -> null
      - name     = "rg-twitter-auto" -> null
        tags     = {
            "Environment" = "Development"
        }
    }

  # module.sa.azurerm_storage_account.sa has been deleted
  - resource "azurerm_storage_account" "sa" {
      - id                                = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Storage/storageAccounts/mysonarqubestorage" -> null
      - name                              = "mysonarqubestorage" -> null
      - primary_access_key                = (sensitive value) -> null
        # (38 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.snet.azurerm_subnet.snet has been deleted
  - resource "azurerm_subnet" "snet" {
      - id                                             = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto/subnets/snet-twitter-auto" -> null
      - name                                           = "snet-twitter-auto" -> null
        # (8 unchanged attributes hidden)
    }

  # module.ss.azurerm_storage_share.ss has been deleted
  - resource "azurerm_storage_share" "ss" {
      - id                   = "https://mysonarqubestorage.file.core.windows.net/mysonarqubedata" -> null
      - name                 = "mysonarqubedata" -> null
      - resource_manager_id  = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Storage/storageAccounts/mysonarqubestorage/fileServices/default/fileshares/mysonarqubedata" -> null
      - url                  = "https://mysonarqubestorage.file.core.windows.net/mysonarqubedata" -> null
        # (5 unchanged attributes hidden)
    }

  # module.vnet.azurerm_virtual_network.vnet has been deleted
  - resource "azurerm_virtual_network" "vnet" {
      - id                      = "/subscriptions/5b185f34-75eb-4245-866b-da6e69404021/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto" -> null
      - name                    = "vnet-twitter-auto" -> null
        tags                    = {
            "Environment" = "Development"
        }
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.azurerm_kubernetes_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_kubernetes_cluster" "cluster" {
      + aci_connector_linux                              = (known after apply)
      + agent_pool_profile                               = (known after apply)
      + api_server_authorized_ip_ranges                  = (known after apply)
      + azure_active_directory_role_based_access_control = (known after apply)
      + azure_policy_enabled                             = (known after apply)
      + current_kubernetes_version                       = (known after apply)
      + custom_ca_trust_certificates_base64              = (known after apply)
      + disk_encryption_set_id                           = (known after apply)
      + dns_prefix                                       = (known after apply)
      + fqdn                                             = (known after apply)
      + http_application_routing_enabled                 = (known after apply)
      + http_application_routing_zone_name               = (known after apply)
      + id                                               = (known after apply)
      + identity                                         = (known after apply)
      + ingress_application_gateway                      = (known after apply)
      + key_management_service                           = (known after apply)
      + key_vault_secrets_provider                       = (known after apply)
      + kube_admin_config                                = (sensitive value)
      + kube_admin_config_raw                            = (sensitive value)
      + kube_config                                      = (sensitive value)
      + kube_config_raw                                  = (sensitive value)
      + kubelet_identity                                 = (known after apply)
      + kubernetes_version                               = (known after apply)
      + linux_profile                                    = (known after apply)
      + location                                         = (known after apply)
      + microsoft_defender                               = (known after apply)
      + name                                             = (sensitive value)
      + network_profile                                  = (known after apply)
      + node_resource_group                              = (known after apply)
      + node_resource_group_id                           = (known after apply)
      + oidc_issuer_enabled                              = (known after apply)
      + oidc_issuer_url                                  = (known after apply)
      + oms_agent                                        = (known after apply)
      + open_service_mesh_enabled                        = (known after apply)
      + private_cluster_enabled                          = (known after apply)
      + private_fqdn                                     = (known after apply)
      + resource_group_name                              = "ecommerce-rg-auto"
      + role_based_access_control_enabled                = (known after apply)
      + service_mesh_profile                             = (known after apply)
      + service_principal                                = (known after apply)
      + storage_profile                                  = (known after apply)
      + tags                                             = (known after apply)
      + windows_profile                                  = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "aks-cluster"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus"
      + name                                = "aks-ecommerce"
      + node_resource_group                 = "nodeaks"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "ecommerce-rg-auto"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "Environment" = "Prod"
          + "Service"     = "Auto"
        }
      + workload_identity_enabled           = false

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2_v2"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.cg.azurerm_container_group.cg will be created
  + resource "azurerm_container_group" "cg" {
      + dns_name_label              = "my-sonarqube"
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = [
          + {
              + port     = 9000
              + protocol = "TCP"
            },
        ]
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Public"
      + location                    = "eastus"
      + name                        = "mysonarcube"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "ecommerce-rg-auto"
      + restart_policy              = "OnFailure"
      + sku                         = "Standard"
      + tags                        = {
          + "Environment" = "Prod"
          + "Service"     = "Auto"
        }

      + container {
          + commands = (known after apply)
          + cpu      = 1
          + image    = "sonarqube:9.2.0-community"
          + memory   = 4
          + name     = "sonarqube"

          + ports {
              + port     = 9000
              + protocol = "TCP"
            }

          + volume {
              + empty_dir            = false
              + mount_path           = "/opt/sonarqube/data"
              + name                 = "sonarqube-data"
              + read_only            = false
              + share_name           = "mysonarqubedata"
              + storage_account_key  = (sensitive value)
              + storage_account_name = "mysonarqubestorage"
            }
          + volume {
              + empty_dir            = false
              + mount_path           = "/opt/sonarqube/extensions"
              + name                 = "sonarqube-extensions"
              + read_only            = false
              + share_name           = "mysonarqubedata"
              + storage_account_key  = (sensitive value)
              + storage_account_name = "mysonarqubestorage"
            }
          + volume {
              + empty_dir            = false
              + mount_path           = "/opt/sonarqube/logs"
              + name                 = "sonarqube-logs"
              + read_only            = false
              + share_name           = "mysonarqubedata"
              + storage_account_key  = (sensitive value)
              + storage_account_name = "mysonarqubestorage"
            }
        }
    }

  # module.mysql.azurerm_mysql_flexible_server.mysql will be created
  + resource "azurerm_mysql_flexible_server" "mysql" {
      + administrator_login           = "mysqladmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 7
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "ecommerce-autoiac-mysqlserver"
      + public_network_access_enabled = (known after apply)
      + replica_capacity              = (known after apply)
      + replication_role              = (known after apply)
      + resource_group_name           = "ecommerce-rg-auto"
      + sku_name                      = "GP_Standard_D2ds_v4"
      + tags                          = {
          + "Environment" = "Prod"
          + "Service"     = "Auto"
        }
      + version                       = "5.7"

      + high_availability {
          + mode = "ZoneRedundant"
        }
    }

  # module.mysql_firewall.azurerm_mysql_flexible_server_firewall_rule.mysql_firewall will be created
  + resource "azurerm_mysql_flexible_server_firewall_rule" "mysql_firewall" {
      + end_ip_address      = "255.255.255.255"
      + id                  = (known after apply)
      + name                = "allow_all_ips"
      + resource_group_name = "ecommerce-rg-auto"
      + server_name         = "ecommerce-autoiac-mysqlserver"
      + start_ip_address    = "0.0.0.0"
    }

  # module.ni.azurerm_network_interface.ni will be created
  + resource "azurerm_network_interface" "ni" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "ni-ecommerce"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "ecommerce-rg-auto"
      + tags                          = {
          + "Environment" = "Prod"
          + "Service"     = "Auto"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "Internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.nisga.azurerm_network_interface_security_group_association.nisga will be created
  + resource "azurerm_network_interface_security_group_association" "nisga" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # module.nsg.azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-ecommerce"
      + resource_group_name = "ecommerce-rg-auto"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "Environment" = "Prod"
          + "Service"     = "Auto"
        }
    }

  # module.rc.azurerm_redis_cache.rc will be created
  + resource "azurerm_redis_cache" "rc" {
      + capacity                      = 2
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus"
      + minimum_tls_version           = "1.2"
      + name                          = "redis-auto"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "ecommerce-rg-auto"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Standard"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "Environment" = "Prod"
          + "Service"     = "Auto"
        }

      + redis_configuration {
          + data_persistence_authentication_method = "SAS"
          + enable_authentication                  = true
          + maxclients                             = (known after apply)
          + maxfragmentationmemory_reserved        = (known after apply)
          + maxmemory_delta                        = (known after apply)
          + maxmemory_policy                       = "volatile-lru"
          + maxmemory_reserved                     = (known after apply)
        }
    }

  # module.rg.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "ecommerce-rg-auto"
      + tags     = {
          + "Environment" = "Prod"
          + "Service"     = "Auto"
        }
    }

  # module.sa.azurerm_storage_account.sa will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = "mysonarqubestorage"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "ecommerce-rg-auto"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Environment" = "Prod"
          + "Service"     = "Auto"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = true
          + versioning_enabled       = false
        }
    }

  # module.sa.azurerm_storage_management_policy.sa_policy will be created
  + resource "azurerm_storage_management_policy" "sa_policy" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "expireOldBlobs"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = 365
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                  + tier_to_cold_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cold_after_days_since_modification_greater_than        = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = -1
                }
            }

          + filters {
              + blob_types = [
                  + "blockBlob",
                ]
            }
        }
    }

  # module.snet.azurerm_subnet.snet will be created
  + resource "azurerm_subnet" "snet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-ecommerce"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "ecommerce-rg-auto"
      + virtual_network_name                           = "vnet-ecommerce"
    }

  # module.ss.azurerm_storage_share.ss will be created
  + resource "azurerm_storage_share" "ss" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "mysonarqubedata"
      + quota                = 1
      + resource_manager_id  = (known after apply)
      + storage_account_name = "mysonarqubestorage"
      + url                  = (known after apply)
    }

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vnet-ecommerce"
      + resource_group_name = "ecommerce-rg-auto"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Prod"
          + "Service"     = "Auto"
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @G20-00, Action: `pull_request`, Workflow: `On Pull Request`*